EA/src/Documents/Сборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Сборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКСборке</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ХранениеЗСЯПоТоварам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Холод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПотерь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКоробкаСЦентральногоСклада</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСобрано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНеХватило</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрогрессСборки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зона</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стелаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСобрано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНеХватило</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Потери</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/AccumulationRegisters/ТоварыКСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаКомплектации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНеХватило</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСборки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/InformationRegisters/СтатусыАктуальностиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтатусыАктуальностиЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусАктуальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыАктуальностиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выгружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУстановкиСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияУстановкиСтатусаДокумента</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/ХранениеЗСЯПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ХранениеЗСЯПоТоварам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗСЯ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/Enums/ТипСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СборкаЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаЗаказовИзКоробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеРезерваПоОтмененнымЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаЯчеекОтТоваровПоОтмененнымЗаказам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Enums/ТипКомплектацииЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипКомплектацииЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СборкаИКомплектацияВАптеке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаНаСкладеВКоробку_КомплектацияВАптеке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаНаСкладеВПакеты_РаскладкаПакетовВАптеке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Documents/Сборка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыКСборке.Очистить();
	Движения.ТоварыКСборке.Записывать = Истина;
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	
	Для каждого СтрокаЗаказов из Товары цикл
		
		Движение = Движения.ТоварыКСборке.ДобавитьРасход();
		Движение.Документ = СтрокаЗаказов.Документ;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Склад = Склад;
		Движение.Товар = СтрокаЗаказов.Товар;
		Если ТипСборки <> Перечисления.ТипСборки.СборкаЗаказовИзКоробки тогда
			Движение.Партия = СтрокаЗаказов.Партия;
		КонецЕсли;
		Движение.ТипСборки = ТипСборки;
		Движение.КоличествоКСборке = СтрокаЗаказов.КоличествоСобрано+СтрокаЗаказов.КоличествоНеХватило;	
		
		Если  (СтрокаЗаказов.КоличествоСобрано > 0 и ТипСборки <> Перечисления.ТипСборки.СборкаПеремещения) или СтрокаЗаказов.КоличествоНеХватило > 0 тогда
			Движение = Движения.ТоварыКСборке.ДобавитьПриход();
			Движение.Документ = СтрокаЗаказов.Документ;
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.Склад = Склад;
			Движение.Товар = СтрокаЗаказов.Товар;
			Если ТипСборки <> Перечисления.ТипСборки.СборкаЗаказовИзКоробки тогда
				Движение.Партия = СтрокаЗаказов.Партия;
			КонецЕсли;
			Движение.ТипСборки = ТипСборки;
			Если ТипСборки = Перечисления.ТипСборки.СборкаПеремещения тогда
				Движение.КоличествоНаКомплектации = 0;	
			Иначе
				Движение.КоличествоНаКомплектации = СтрокаЗаказов.КоличествоСобрано;
			КонецЕсли;
			Движение.КоличествоНеХватило = СтрокаЗаказов.КоличествоНеХватило;
		КонецЕсли;
		
		Если ТипСборки = Перечисления.ТипСборки.СборкаЗаказа 
			или ТипСборки = Перечисления.ТипСборки.СборкаПеремещения тогда				
			Движение = Движения.ОстаткиТовара.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.Товар = СтрокаЗаказов.Товар;
			Движение.Отдел = Склад;
			Движение.ДокументРезерва = СтрокаЗаказов.Документ;
			Движение.Партия = СтрокаЗаказов.Партия;
			Движение.Резерв = СтрокаЗаказов.КоличествоСобрано;	
		КонецЕсли;
	КонецЦикла;
	
	//Спишем остатки по потерям	
	Для каждого СтрокаПотери из Потери цикл
		
		Движение = Движения.ОстаткиТовара.ДобавитьРасход();
		Движение.Отдел = Склад;
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;
		Движение.Товар = СтрокаПотери.Товар;
		Движение.Партия = СтрокаПотери.Партия;
		Движение.ДокументРезерва = СтрокаПотери.Документ;
		Движение.Остаток = СтрокаПотери.Остаток;
		
		Движение = Движения.ОстаткиТовара.ДобавитьРасход();
		Движение.Отдел = Склад;
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;
		Движение.Товар = СтрокаПотери.Товар;
		Движение.Партия = СтрокаПотери.Партия;
		Движение.ДокументРезерва = СтрокаПотери.Документ;
		Движение.Резерв = СтрокаПотери.Резерв;
		
		Движение = Движения.ОстаткиТовара.ДобавитьПриход();
		Движение.Отдел = СкладПотерь;
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;
		Движение.Товар = СтрокаПотери.Товар;
		Движение.Партия = СтрокаПотери.Партия;
		Движение.Остаток = СтрокаПотери.Остаток+СтрокаПотери.Резерв;
		
	КонецЦикла;
	//Если это перемещение заполним результат сборки в документе основании
	Если ТипСборки = Перечисления.ТипСборки.СборкаПеремещения и ЗначениеЗаполнено(ДокументОснование) и не ДокументОснование.СборкаЗавершена тогда
		
		Движения.ТоварыКСборке.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ТоварыКСборкеОстатки.КоличествоКСборкеОстаток) КАК КоличествоКСборкеОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыКСборке.Остатки(, Документ = &Документ) КАК ТоварыКСборкеОстатки
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыКСборкеОстатки.КоличествоКСборкеОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКСборкеОбороты.Товар,
		|	ТоварыКСборкеОбороты.Партия,
		|	ТоварыКСборкеОбороты.КоличествоКСборкеРасход - ЕСТЬNULL(СУММА(ЕСТЬNULL(СборкаТовары.КоличествоНеХватило, 0)), 0) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыКСборке.Обороты КАК ТоварыКСборкеОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сборка.Товары КАК СборкаТовары
		|		ПО ТоварыКСборкеОбороты.Документ = СборкаТовары.Ссылка.ДокументОснование
		|			И ТоварыКСборкеОбороты.Товар = СборкаТовары.Товар
		|			И ТоварыКСборкеОбороты.Партия = СборкаТовары.Партия
		|			И (СборкаТовары.Ссылка.Проведен)
		|ГДЕ
		|	ТоварыКСборкеОбороты.Документ = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКСборкеОбороты.Товар,
		|	ТоварыКСборкеОбороты.Партия,
		|	ТоварыКСборкеОбороты.КоличествоКСборкеРасход";
		
		Запрос.УстановитьПараметр("Документ", ДокументОснование);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Перемещение = ДокументОснование.ПолучитьОбъект();
		ВыборкаТовары = МассивРезультатов[1].Выбрать();
		Пока ВыборкаТовары.Следующий() цикл
			МассивСтрок = Перемещение.Товары.НайтиСтроки(Новый Структура("Товар,Партия",ВыборкаТовары.Товар, ВыборкаТовары.Партия));
			Для каждого строка из МассивСтрок цикл
				Строка.Количество = ВыборкаТовары.Количество;
			КонецЦикла;
		КонецЦикла;
		
		Если МассивРезультатов[0].Пустой() тогда
			Перемещение.СборкаЗавершена = Истина;
		КонецЕсли;			
		Перемещение.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	//Установим статус заказа
	Если ТипСборки = Перечисления.ТипСборки.СборкаЗаказа тогда
		Движения.ТоварыКСборке.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаТовары.Документ
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	Документ.Сборка.Товары КАК СборкаТовары
		|ГДЕ
		|	СборкаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СборкаТовары.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКСборкеОстатки.Документ,
		|	СУММА(ТоварыКСборкеОстатки.КоличествоКСборкеОстаток) КАК КоличествоКСборкеОстаток
		|ПОМЕСТИТЬ втНеСобранныеЗаказы
		|ИЗ
		|	РегистрНакопления.ТоварыКСборке.Остатки(
		|			&Дата,
		|			Документ В
		|				(ВЫБРАТЬ
		|					втЗаказы.Документ
		|				ИЗ
		|					втЗаказы КАК втЗаказы)) КАК ТоварыКСборкеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКСборкеОстатки.Документ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыКСборкеОстатки.КоличествоКСборкеОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКСборкеОстатки.Документ,
		|	СУММА(ТоварыКСборкеОстатки.КоличествоНеХватилоОстаток) КАК КоличествоНеХватилоОстаток
		|ПОМЕСТИТЬ втЗаказыНаОбработкуМРК
		|ИЗ
		|	РегистрНакопления.ТоварыКСборке.Остатки(
		|			&Дата,
		|			Документ В
		|				(ВЫБРАТЬ
		|					втЗаказы.Документ
		|				ИЗ
		|					втЗаказы КАК втЗаказы
		|				ГДЕ
		|					ВЫРАЗИТЬ(втЗаказы.Документ КАК Документ.Заказ).ТипКомплектацииЗаказа = ЗНАЧЕНИЕ(перечисление.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке)
		|					И втЗаказы.Документ ССЫЛКА Документ.Заказ)) КАК ТоварыКСборкеОстатки
		|ГДЕ
		|	ТоварыКСборкеОстатки.КоличествоНеХватилоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКСборкеОстатки.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыАктуальностиЗаказовСрезПоследних.Документ
		|ПОМЕСТИТЬ втОтмененные
		|ИЗ
		|	РегистрСведений.СтатусыАктуальностиЗаказов.СрезПоследних(
		|			,
		|			Документ В
		|				(ВЫБРАТЬ
		|					втЗаказы.Документ
		|				ИЗ
		|					втЗаказы КАК втЗаказы
		|				ГДЕ
		|					ВЫРАЗИТЬ(втЗаказы.Документ КАК Документ.Заказ).ТипКомплектацииЗаказа = ЗНАЧЕНИЕ(перечисление.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке)
		|					И втЗаказы.Документ ССЫЛКА Документ.Заказ)) КАК СтатусыАктуальностиЗаказовСрезПоследних
		|ГДЕ
		|	СтатусыАктуальностиЗаказовСрезПоследних.СтатусАктуальности = ЗНАЧЕНИЕ(справочник.СтатусыАктуальностиЗаказов.Отменен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ЕСТЬNULL(ХранениеЗСЯПоТоварамОстатки.КоличествоОстаток, 0)), 0) КАК КоличествоОстаток,
		|	втЗаказы.Документ КАК Документ
		|ПОМЕСТИТЬ втВсеВНехватило
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ХранениеЗСЯПоТоварам.Остатки(
		|				&Дата,
		|				Документ В
		|					(ВЫБРАТЬ
		|						втЗаказы.Документ
		|					ИЗ
		|						втЗаказы КАК втЗаказы)) КАК ХранениеЗСЯПоТоварамОстатки
		|		ПО (ХранениеЗСЯПоТоварамОстатки.Документ = втЗаказы.Документ)
		|
		|СГРУППИРОВАТЬ ПО
		|	втЗаказы.Документ
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(СУММА(ЕСТЬNULL(ХранениеЗСЯПоТоварамОстатки.КоличествоОстаток, 0)), 0) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказы.Документ,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА втЗаказыНаОбработкуМРК.Документ ЕСТЬ NULL
		|					ИЛИ НЕ втОтмененные.Документ ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК НаОбработкуМРК,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА втВсеВНехватило.Документ ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ЗаказНеСобран
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНеСобранныеЗаказы КАК втНеСобранныеЗаказы
		|		ПО втЗаказы.Документ = втНеСобранныеЗаказы.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказыНаОбработкуМРК КАК втЗаказыНаОбработкуМРК
		|		ПО втЗаказы.Документ = втЗаказыНаОбработкуМРК.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОтмененные КАК втОтмененные
		|		ПО втЗаказы.Документ = втОтмененные.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВсеВНехватило КАК втВсеВНехватило
		|		ПО втЗаказы.Документ = втВсеВНехватило.Документ
		|ГДЕ
		|	втНеСобранныеЗаказы.Документ ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	втЗаказы.Документ";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Дата",Новый Граница(Дата,ВидГраницы.Включая));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если Выборка.ЗаказНеСобран тогда
				СтатусыДокументов.УстановитьСтатусСборкиЗаказа(Выборка.Документ,Ссылка,Справочники.СтатусыОбработкиЗаказа.Отменен,Сотрудник,Дата);
			Иначе
				СтатусыДокументов.УстановитьСтатусСборкиЗаказа(Выборка.Документ,Ссылка,Справочники.СтатусыОбработкиЗаказа.Собран,Сотрудник,Дата);
			КонецЕсли;
			Если Выборка.НаОбработкуМРК тогда
				СтатусыДокументов.УстановитьСтатусАктуальностиЗаказа(Выборка.Документ,Ссылка,Справочники.СтатусыАктуальностиЗаказов.ОжидаетОбработкиМРК,Сотрудник,Дата);	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
